---
kind: property
id: P:Autodesk.Revit.DB.Electrical.AreaBasedLoadData.PhasesNumber
source: html/d63e643c-917f-ca52-5d3a-af59cb7b5343.htm
---
# Autodesk.Revit.DB.Electrical.AreaBasedLoadData.PhasesNumber Property

The Phases Number of the area based load.

## Syntax (C#)
```csharp
public int PhasesNumber { get; }
```

## Remarks
This property is used to retrieve the Phases Number.